
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Начисления
	Движения.Начисления.Записывать = Истина;
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.Начисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаНачисления.ПериодДействияНачало;
		Движение.ПериодДействияКонец = ТекСтрокаНачисления.ПериодДействияКонец;
		Движение.ПериодРегистрации = Дата;
		Движение.БазовыйПериодНачало = ТекСтрокаНачисления.БазовыйПериодНачало;
		Движение.БазовыйПериодКонец = ТекСтрокаНачисления.БазовыйПериодКонец;
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		Движение.Параметр = ТекСтрокаНачисления.Параметр;
		Движение.График = ТекСтрокаНачисления.График;
	КонецЦикла; 
	
	Движения.Записать(); 
	
	Расчеты.РассчитатьЗаписи(Ссылка);

КонецПроцедуры
