Процедура РассчитатьЗаписи(Ссылка) Экспорт
	
	НаборЗаписей = РегистрыРасчета.Начисления.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		
		ВидРасчета = Запись.ВидРасчета;
		
		Если ВидРасчета = ПланыВидовРасчета.Начисления.Оклад Тогда 
			
			Норма = Запись.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ПериодДействия)[0].Признак;
			Факт = Запись.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ФактическийПериодДействия)[0].Признак;
			Запись.Сумма = Факт / Норма * Запись.Параметр;
			
		ИначеЕсли ВидРасчета = ПланыВидовРасчета.Начисления.Премия Тогда
			
			Ресурсы = Новый Массив;
			Ресурсы.Добавить("Начисления.Сумма");
			
			Измерения = Новый Структура;
			Измерения.Вставить("Сотрудник", "Начисления.Сотрудник");
			
			ТЗБаза = Запись.ПолучитьБазу(Ресурсы, Измерения);
			
			Запись.Сумма = ТЗБаза[0].Сумма * Запись.Параметр / 100;
			
			
		ИначеЕсли ВидРасчета = ПланыВидовРасчета.Начисления.ОкладПоДням Тогда
			
			Факт = Запись.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ПериодДействия)[0].Признак;
			Запись.Сумма = Факт * Запись.Параметр; 
			
		КонецЕсли;
		
	КонецЦикла;    
	
	НаборЗаписей.Записать(,, Ложь);
	
КонецПроцедуры