
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Начисления
	Движения.Начисления.Записывать = Истина;
	Движение = Движения.Начисления.Добавить();
	//Движение.Сторно = Ложь;
	Движение.ПериодДействияНачало = НачалоМесяца(Дата);
	Движение.ПериодДействияКонец = НачалоМесяца(Дата); 
	
	Движение.БазовыйПериодНачало = БазовыйПериодНачало;
	Движение.БазовыйПериодКонец = БазовыйПериодКонец;
	
	Движение.ПериодРегистрации = Дата;
	Движение.Сотрудник = Сотрудник;  
	Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Премия;  
	Движение.Параметр = ПроцентПремии;  
	
	Движения.Начисления.Записать(); 
	
	Запись = Движения.Начисления[0];
	
	Ресурсы = Новый Массив;
	Ресурсы.Добавить("Начисления.Сумма"); 
	
	Измерения = Новый Структура;
	Измерения.Вставить("Сотрудник", "Начисления.Сотрудник");
	
    ТЗБаза = Запись.ПолучитьБазу(Ресурсы, Измерения);
	
	Запись.Сумма = ТЗБаза[0].Сумма * ПроцентПремии / 100;
	
	
	Движения.Начисления.Записать();

КонецПроцедуры
